maddogjt/Amulet_Arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2017 Adafruit Industries.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.softdevice=SoftDevice
menu.debug=Debug

# ----------------------------------
# Bluefruit Feather nRF52832
# ----------------------------------
feather52832.name=Adafruit Feather nRF52832 (Amulet)
feather52832.bootloader.tool=bootburn

# Upload
feather52832.upload.tool=nrfutil
feather52832.upload.protocol=nrfutil
feather52832.upload.use_1200bps_touch=false
feather52832.upload.wait_for_upload_port=false
feather52832.upload.native_usb=false
feather52832.upload.maximum_size=290816
feather52832.upload.maximum_data_size=52224

# Build
feather52832.build.mcu=cortex-m4
feather52832.build.f_cpu=64000000
feather52832.build.board=NRF52832_FEATHER
feather52832.build.core=nRF5
feather52832.build.variant=feather_nrf52832
feather52832.build.usb_manufacturer="Adafruit LLC"
feather52832.build.usb_product="Feather nRF52832"
feather52832.build.extra_flags=-DNRF52832_XXAA -DNRF52
feather52832.build.ldscript=nrf52832_s132_v6.ld
feather52832.build.dev_type=0xA137
feather52832.build.bootloader_ver=1.1.0

# SofDevice Menu
feather52832.menu.softdevice.s132v6=S132 6.1.1
feather52832.menu.softdevice.s132v6.build.sd_name=s132
feather52832.menu.softdevice.s132v6.build.sd_version=6.1.1
feather52832.menu.softdevice.s132v6.build.sd_fwid=0x00B7

feather52832.menu.softdevice.adafs132v6=Adafruit S132 6.1.1
feather52832.menu.softdevice.adafs132v6.build.sd_name=s132
feather52832.menu.softdevice.adafs132v6.build.sd_version=6.1.1
feather52832.menu.softdevice.adafs132v6.build.sd_fwid=0x00B7
feather52832.menu.softdevice.adafs132v6.build.dev_type=0x0052

# Debug Menu
feather52832.menu.debug.l0=Level 0 (Release)
feather52832.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
feather52832.menu.debug.l1=Level 1 (Error Message)
feather52832.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
feather52832.menu.debug.l2=Level 2 (Full Debug)
feather52832.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
feather52832.menu.debug.l3=Level 3 (Segger SystemView)
feather52832.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
feather52832.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# # ----------------------------------
# # Bluefruit Feather nRF52840 Express
# # ----------------------------------
# feather52840.name=Adafruit Feather nRF52840 Express

# # VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
# feather52840.vid.0=0x239A
# feather52840.pid.0=0x8029
# feather52840.vid.1=0x239A
# feather52840.pid.1=0x0029
# feather52840.vid.2=0x239A
# feather52840.pid.2=0x002A
# feather52840.vid.3=0x239A
# feather52840.pid.3=0x802A

# # Upload
# feather52840.bootloader.tool=bootburn
# feather52840.upload.tool=nrfutil
# feather52840.upload.protocol=nrfutil
# feather52840.upload.use_1200bps_touch=true
# feather52840.upload.wait_for_upload_port=true
# feather52840.upload.maximum_size=815104
# feather52840.upload.maximum_data_size=237568

# # Build
# feather52840.build.mcu=cortex-m4
# feather52840.build.f_cpu=64000000
# feather52840.build.board=NRF52840_FEATHER
# feather52840.build.core=nRF5
# feather52840.build.variant=feather_nrf52840_express
# feather52840.build.usb_manufacturer="Adafruit LLC"
# feather52840.build.usb_product="Feather nRF52840 Express"
# feather52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
# feather52840.build.ldscript=nrf52840_s140_v6.ld
# feather52840.build.vid=0x239A
# feather52840.build.pid=0x8029

# # SofDevice Menu
# feather52840.menu.softdevice.s140v6=S140 6.1.1
# feather52840.menu.softdevice.s140v6.build.sd_name=s140
# feather52840.menu.softdevice.s140v6.build.sd_version=6.1.1
# feather52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# # Debug Menu
# feather52840.menu.debug.l0=Level 0 (Release)
# feather52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
# feather52840.menu.debug.l1=Level 1 (Error Message)
# feather52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
# feather52840.menu.debug.l2=Level 2 (Full Debug)
# feather52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
# feather52840.menu.debug.l3=Level 3 (Segger SystemView)
# feather52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
# feather52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# # ----------------------------------
# # Feather nRF52840 sense
# # ----------------------------------
# feather52840sense.name=Adafruit Feather nRF52840 Sense

# # VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
# feather52840sense.vid.0=0x239A
# feather52840sense.pid.0=0x8087
# feather52840sense.vid.1=0x239A
# feather52840sense.pid.1=0x0087
# feather52840sense.vid.2=0x239A
# feather52840sense.pid.2=0x0088
# feather52840sense.vid.3=0x239A
# feather52840sense.pid.3=0x8088

# # Upload
# feather52840sense.bootloader.tool=bootburn
# feather52840sense.upload.tool=nrfutil
# feather52840sense.upload.protocol=nrfutil
# feather52840sense.upload.use_1200bps_touch=true
# feather52840sense.upload.wait_for_upload_port=true
# feather52840sense.upload.maximum_size=815104
# feather52840sense.upload.maximum_data_size=237568

# # Build
# feather52840sense.build.mcu=cortex-m4
# feather52840sense.build.f_cpu=64000000
# feather52840sense.build.board=NRF52840_FEATHER_SENSE
# feather52840sense.build.core=nRF5
# feather52840sense.build.variant=feather_nrf52840_sense
# feather52840sense.build.usb_manufacturer="Adafruit LLC"
# feather52840sense.build.usb_product="Feather nRF52840 Sense"
# feather52840sense.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
# feather52840sense.build.ldscript=nrf52840_s140_v6.ld
# feather52840sense.build.vid=0x239A
# feather52840sense.build.pid=0x8087

# # SofDevice Menu
# feather52840sense.menu.softdevice.s140v6=S140 6.1.1
# feather52840sense.menu.softdevice.s140v6.build.sd_name=s140
# feather52840sense.menu.softdevice.s140v6.build.sd_version=6.1.1
# feather52840sense.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# # Debug Menu
# feather52840sense.menu.debug.l0=Level 0 (Release)
# feather52840sense.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
# feather52840sense.menu.debug.l1=Level 1 (Error Message)
# feather52840sense.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
# feather52840sense.menu.debug.l2=Level 2 (Full Debug)
# feather52840sense.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
# feather52840sense.menu.debug.l3=Level 3 (Segger SystemView)
# feather52840sense.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
# feather52840sense.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# # ---------------------------------------------
# # Bluefruit ItsyBitsy nRF52840 Express
# # ---------------------------------------------
# itsybitsy52840.name=Adafruit ItsyBitsy nRF52840 Express

