maddogjt/Amulet_Arduino/boards.txt
# # VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
# itsybitsy52840.vid.0=0x239A
# itsybitsy52840.pid.0=0x8051
# itsybitsy52840.vid.1=0x239A
# itsybitsy52840.pid.1=0x0051
# itsybitsy52840.vid.2=0x239A
# itsybitsy52840.pid.2=0x0052
# itsybitsy52840.vid.3=0x239A
# itsybitsy52840.pid.3=0x8052

# # Upload
# itsybitsy52840.bootloader.tool=bootburn
# itsybitsy52840.upload.tool=nrfutil
# itsybitsy52840.upload.protocol=nrfutil
# itsybitsy52840.upload.use_1200bps_touch=true
# itsybitsy52840.upload.wait_for_upload_port=true
# itsybitsy52840.upload.maximum_size=815104
# itsybitsy52840.upload.maximum_data_size=237568

# # Build
# itsybitsy52840.build.mcu=cortex-m4
# itsybitsy52840.build.f_cpu=64000000
# itsybitsy52840.build.board=NRF52840_ITSYBITSY
# itsybitsy52840.build.core=nRF5
# itsybitsy52840.build.variant=itsybitsy_nrf52840_express
# itsybitsy52840.build.usb_manufacturer="Adafruit LLC"
# itsybitsy52840.build.usb_product="ItsyBitsy nRF52840 Express"
# itsybitsy52840.build.extra_flags=-DNRF52840_XXAA -DARDUINO_NRF52_ITSYBITSY {build.flags.usb}
# itsybitsy52840.build.ldscript=nrf52840_s140_v6.ld
# itsybitsy52840.build.vid=0x239A
# itsybitsy52840.build.pid=0x8051

# # SofDevice Menu
# itsybitsy52840.menu.softdevice.s140v6=0.2.11 SoftDevice s140 6.1.1
# itsybitsy52840.menu.softdevice.s140v6.build.sd_name=s140
# itsybitsy52840.menu.softdevice.s140v6.build.sd_version=6.1.1
# itsybitsy52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# # Debug Menu
# itsybitsy52840.menu.debug.l0=Level 0 (Release)
# itsybitsy52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
# itsybitsy52840.menu.debug.l1=Level 1 (Error Message)
# itsybitsy52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
# itsybitsy52840.menu.debug.l2=Level 2 (Full Debug)
# itsybitsy52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
# itsybitsy52840.menu.debug.l3=Level 3 (Segger SystemView)
# itsybitsy52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
# itsybitsy52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# # ---------------------------------------------
# # Bluefruit Circuit Playground nRF52840 Express
# # ---------------------------------------------
# cplaynrf52840.name=Adafruit Circuit Playground Bluefruit

# # VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
# cplaynrf52840.vid.0=0x239A
# cplaynrf52840.pid.0=0x8045
# cplaynrf52840.vid.1=0x239A
# cplaynrf52840.pid.1=0x0045
# cplaynrf52840.vid.2=0x239A
# cplaynrf52840.pid.2=0x0046
# cplaynrf52840.vid.3=0x239A
# cplaynrf52840.pid.3=0x8046

# # Upload
# cplaynrf52840.bootloader.tool=bootburn
# cplaynrf52840.upload.tool=nrfutil
# cplaynrf52840.upload.protocol=nrfutil
# cplaynrf52840.upload.use_1200bps_touch=true
# cplaynrf52840.upload.wait_for_upload_port=true
# cplaynrf52840.upload.maximum_size=815104
# cplaynrf52840.upload.maximum_data_size=237568

# # Build
# cplaynrf52840.build.mcu=cortex-m4
# cplaynrf52840.build.f_cpu=64000000
# cplaynrf52840.build.board=NRF52840_CIRCUITPLAY
# cplaynrf52840.build.core=nRF5
# cplaynrf52840.build.variant=circuitplayground_nrf52840
# cplaynrf52840.build.usb_manufacturer="Adafruit LLC"
# cplaynrf52840.build.usb_product="Circuit Playground Bluefruit"
# cplaynrf52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
# cplaynrf52840.build.ldscript=nrf52840_s140_v6.ld
# cplaynrf52840.build.vid=0x239A
# cplaynrf52840.build.pid=0x8045

# # SofDevice Menu
# cplaynrf52840.menu.softdevice.s140v6=S140 6.1.1
# cplaynrf52840.menu.softdevice.s140v6.build.sd_name=s140
# cplaynrf52840.menu.softdevice.s140v6.build.sd_version=6.1.1
# cplaynrf52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# # Debug Menu
# cplaynrf52840.menu.debug.l0=Level 0 (Release)
# cplaynrf52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
# cplaynrf52840.menu.debug.l1=Level 1 (Error Message)
# cplaynrf52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
# cplaynrf52840.menu.debug.l2=Level 2 (Full Debug)
# cplaynrf52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
# cplaynrf52840.menu.debug.l3=Level 3 (Segger SystemView)
# cplaynrf52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
# cplaynrf52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# # ---------------------------------------------
# # Clue nRF52840
# # ---------------------------------------------
# cluenrf52840.name=Adafruit CLUE

# # VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
# cluenrf52840.vid.0=0x239A
# cluenrf52840.pid.0=0x8072
# cluenrf52840.vid.1=0x239A
# cluenrf52840.pid.1=0x0072
# cluenrf52840.vid.2=0x239A
# cluenrf52840.pid.2=0x0071
# cluenrf52840.vid.3=0x239A
# cluenrf52840.pid.3=0x8071

# # Upload
# cluenrf52840.bootloader.tool=bootburn
# cluenrf52840.upload.tool=nrfutil
# cluenrf52840.upload.protocol=nrfutil
# cluenrf52840.upload.use_1200bps_touch=true
# cluenrf52840.upload.wait_for_upload_port=true
# cluenrf52840.upload.maximum_size=815104
# cluenrf52840.upload.maximum_data_size=237568

# # Build
# cluenrf52840.build.mcu=cortex-m4
# cluenrf52840.build.f_cpu=64000000
# cluenrf52840.build.board=NRF52840_CLUE
# cluenrf52840.build.core=nRF5
# cluenrf52840.build.variant=clue_nrf52840
# cluenrf52840.build.usb_manufacturer="Adafruit LLC"
# cluenrf52840.build.usb_product="CLUE"
# cluenrf52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
# cluenrf52840.build.ldscript=nrf52840_s140_v6.ld
# cluenrf52840.build.vid=0x239A
# cluenrf52840.build.pid=0x8071

# # SofDevice Menu
# cluenrf52840.menu.softdevice.s140v6=S140 6.1.1
# cluenrf52840.menu.softdevice.s140v6.build.sd_name=s140
# cluenrf52840.menu.softdevice.s140v6.build.sd_version=6.1.1
# cluenrf52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# # Debug Menu
# cluenrf52840.menu.debug.l0=Level 0 (Release)
# cluenrf52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
# cluenrf52840.menu.debug.l1=Level 1 (Error Message)
# cluenrf52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
# cluenrf52840.menu.debug.l2=Level 2 (Full Debug)
# cluenrf52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
# cluenrf52840.menu.debug.l3=Level 3 (Segger SystemView)
# cluenrf52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
# cluenrf52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# # ----------------------------------
# # Metro nRF52840 Express
# # ----------------------------------
# metro52840.name=Adafruit Metro nRF52840 Express

