maddogjt/Amulet_Arduino/boards.txt
# # VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
# metro52840.vid.0=0x239A
# metro52840.pid.0=0x803F
# metro52840.vid.1=0x239A
# metro52840.pid.1=0x003F
# metro52840.vid.2=0x239A
# metro52840.pid.2=0x0040
# metro52840.vid.3=0x239A
# metro52840.pid.3=0x8040

# # Upload
# metro52840.bootloader.tool=bootburn
# metro52840.upload.tool=nrfutil
# metro52840.upload.protocol=nrfutil
# metro52840.upload.use_1200bps_touch=true
# metro52840.upload.wait_for_upload_port=true
# metro52840.upload.maximum_size=815104
# metro52840.upload.maximum_data_size=237568

# # Build
# metro52840.build.mcu=cortex-m4
# metro52840.build.f_cpu=64000000
# metro52840.build.board=NRF52840_METRO
# metro52840.build.core=nRF5
# metro52840.build.variant=metro_nrf52840_express
# metro52840.build.usb_manufacturer="Adafruit LLC"
# metro52840.build.usb_product="Metro nRF52840 Express"
# metro52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
# metro52840.build.ldscript=nrf52840_s140_v6.ld
# metro52840.build.vid=0x239A
# metro52840.build.pid=0x803F

# # SofDevice Menu
# metro52840.menu.softdevice.s140v6=S140 6.1.1
# metro52840.menu.softdevice.s140v6.build.sd_name=s140
# metro52840.menu.softdevice.s140v6.build.sd_version=6.1.1
# metro52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# # Debug Menu
# metro52840.menu.debug.l0=Level 0 (Release)
# metro52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
# metro52840.menu.debug.l1=Level 1 (Error Message)
# metro52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
# metro52840.menu.debug.l2=Level 2 (Full Debug)
# metro52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
# metro52840.menu.debug.l3=Level 3 (Segger SystemView)
# metro52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
# metro52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1




# # -------------------------------------------------------
# # 
# # Boards that aren't made by Adafruit
# #
# # -------------------------------------------------------


# # ----------------------------------
# # Nordic nRF52840DK (PCA10056)
# # ----------------------------------
# pca10056.name=Nordic nRF52840DK (PCA10056)
# pca10056.bootloader.tool=bootburn

# # Upload
# pca10056.upload.tool=nrfutil
# pca10056.upload.protocol=nrfutil
# pca10056.upload.use_1200bps_touch=true
# pca10056.upload.wait_for_upload_port=true
# pca10056.upload.maximum_size=815104
# pca10056.upload.maximum_data_size=237568

# # Build
# pca10056.build.mcu=cortex-m4
# pca10056.build.f_cpu=64000000
# pca10056.build.board=NRF52840_PCA10056
# pca10056.build.core=nRF5
# pca10056.build.variant=pca10056
# pca10056.build.usb_manufacturer="Nordic"
# pca10056.build.usb_product="nRF52840 DK"
# pca10056.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
# pca10056.build.ldscript=nrf52840_s140_v6.ld
# pca10056.build.vid=0x239A
# pca10056.build.pid=0x8029

# # SofDevice Menu
# pca10056.menu.softdevice.s140v6=S140 6.1.1
# pca10056.menu.softdevice.s140v6.build.sd_name=s140
# pca10056.menu.softdevice.s140v6.build.sd_version=6.1.1
# pca10056.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# # Debug Menu
# pca10056.menu.debug.l0=Level 0 (Release)
# pca10056.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
# pca10056.menu.debug.l1=Level 1 (Error Message)
# pca10056.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
# pca10056.menu.debug.l2=Level 2 (Full Debug)
# pca10056.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
# pca10056.menu.debug.l3=Level 3 (Segger SystemView)
# pca10056.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
# pca10056.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# # ----------------------------------
# # Particle Xenon
# # ----------------------------------
# particle_xenon.name=Particle Xenon

# # VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
# particle_xenon.vid.0=0x239A
# particle_xenon.pid.0=0x8029
# particle_xenon.vid.1=0x239A
# particle_xenon.pid.1=0x0029
# particle_xenon.vid.2=0x239A
# particle_xenon.pid.2=0x002A
# particle_xenon.vid.3=0x239A
# particle_xenon.pid.3=0x802A

# # Upload
# particle_xenon.bootloader.tool=bootburn
# particle_xenon.upload.tool=nrfutil
# particle_xenon.upload.protocol=nrfutil
# particle_xenon.upload.use_1200bps_touch=true
# particle_xenon.upload.wait_for_upload_port=true
# particle_xenon.upload.maximum_size=815104
# particle_xenon.upload.maximum_data_size=237568

# # Build
# particle_xenon.build.mcu=cortex-m4
# particle_xenon.build.f_cpu=64000000
# particle_xenon.build.board=PARTICLE_XENON
# particle_xenon.build.core=nRF5
# particle_xenon.build.variant=particle_xenon
# particle_xenon.build.usb_manufacturer="Particle Industries"
# particle_xenon.build.usb_product="Particle Xenon"
# particle_xenon.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
# particle_xenon.build.ldscript=nrf52840_s140_v6.ld
# particle_xenon.build.vid=0x239A
# particle_xenon.build.pid=0x8029

# # SofDevice Menu
# particle_xenon.menu.softdevice.s140v6=S140 6.1.1
# particle_xenon.menu.softdevice.s140v6.build.sd_name=s140
# particle_xenon.menu.softdevice.s140v6.build.sd_version=6.1.1
# particle_xenon.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# # Debug Menu
# particle_xenon.menu.debug.l0=Level 0 (Release)
# particle_xenon.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
# particle_xenon.menu.debug.l1=Level 1 (Error Message)
# particle_xenon.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
# particle_xenon.menu.debug.l2=Level 2 (Full Debug)
# particle_xenon.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
# particle_xenon.menu.debug.l3=Level 3 (Segger SystemView)
# particle_xenon.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
# particle_xenon.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# # ----------------------------------
# # Raytac MDBT50Q - RX
# # ----------------------------------
# mdbt50qrx.name=Raytac MDBT50Q-RX Dongle

# # VID/PID for bootloader, Arduino + Circuitpython App
# mdbt50qrx.vid.0=0x239A
# mdbt50qrx.pid.0=0x810B
# mdbt50qrx.vid.1=0x239A
# mdbt50qrx.pid.1=0x010B
# mdbt50qrx.vid.2=0x239A
# mdbt50qrx.pid.2=0x810C

# # Upload
# mdbt50qrx.bootloader.tool=bootburn
# mdbt50qrx.upload.tool=nrfutil
# mdbt50qrx.upload.protocol=nrfutil
# mdbt50qrx.upload.use_1200bps_touch=true
# mdbt50qrx.upload.wait_for_upload_port=true
# mdbt50qrx.upload.maximum_size=815104
# mdbt50qrx.upload.maximum_data_size=237568

# # Build
# mdbt50qrx.build.mcu=cortex-m4
# mdbt50qrx.build.f_cpu=64000000
# mdbt50qrx.build.board=MDBT50Q_RX
# mdbt50qrx.build.core=nRF5
# mdbt50qrx.build.variant=raytac_mdbt50q_rx
# mdbt50qrx.build.usb_manufacturer="Raytac"
# mdbt50qrx.build.usb_product="nRF52840 Dongle"
# mdbt50qrx.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
# mdbt50qrx.build.ldscript=nrf52840_s140_v6.ld
# mdbt50qrx.build.vid=0x239A
# mdbt50qrx.build.pid=0x810B

# # SofDevice Menu
# mdbt50qrx.menu.softdevice.s140v6=S140 6.1.1
# mdbt50qrx.menu.softdevice.s140v6.build.sd_name=s140
# mdbt50qrx.menu.softdevice.s140v6.build.sd_version=6.1.1
# mdbt50qrx.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# # Debug Menu
# mdbt50qrx.menu.debug.l0=Level 0 (Release)
# mdbt50qrx.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
# mdbt50qrx.menu.debug.l1=Level 1 (Error Message)
# mdbt50qrx.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
# mdbt50qrx.menu.debug.l2=Level 2 (Full Debug)
# mdbt50qrx.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
# mdbt50qrx.menu.debug.l3=Level 3 (Segger SystemView)
# mdbt50qrx.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
# mdbt50qrx.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Amulet of Rune (MP)
# ----------------------------------
amulet_mp.name=Amulet of Rune
amulet_mp.bootloader.tool=bootburn

# Upload
amulet_mp.upload.tool=nrfutil
amulet_mp.upload.protocol=nrfutil
amulet_mp.upload.use_1200bps_touch=false
amulet_mp.upload.wait_for_upload_port=false
amulet_mp.upload.native_usb=false
amulet_mp.upload.maximum_size=290816
amulet_mp.upload.maximum_data_size=51072

# Build
amulet_mp.build.mcu=cortex-m4
amulet_mp.build.f_cpu=64000000
amulet_mp.build.board=AMULET_MP
amulet_mp.build.core=nRF5
amulet_mp.build.variant=amulet_mp
amulet_mp.build.usb_manufacturer="Adafruit LLC"
amulet_mp.build.usb_product="Amulet of Rune"
amulet_mp.build.extra_flags=-DNRF52832_XXAA -DNRF52 '-DUSB_MANUFACTURER={build.usb_manufacturer}' '-DUSB_PRODUCT={build.usb_product}'
amulet_mp.build.ldscript=nrf52832_s132_v6.ld
amulet_mp.build.dev_type=0xA137
amulet_mp.build.bootloader_ver=1.1.0

# SofDevice Menu
amulet_mp.menu.softdevice.s132v6=S132 6.1.1
amulet_mp.menu.softdevice.s132v6.build.sd_name=s132
amulet_mp.menu.softdevice.s132v6.build.sd_version=6.1.1
amulet_mp.menu.softdevice.s132v6.build.sd_fwid=0x00B7

# Debug Menu
amulet_mp.menu.debug.l0=Level 0 (Release)
amulet_mp.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
amulet_mp.menu.debug.l1=Level 1 (Error Message)
amulet_mp.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
amulet_mp.menu.debug.l2=Level 2 (Full Debug)
amulet_mp.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
amulet_mp.menu.debug.l3=Level 3 (Segger SystemView)
amulet_mp.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
amulet_mp.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1
